# Pandas Section 5

## Series

In [2]:
# need to add crash course notes in here. All notes form section 1 to 5 were lost 
# pandas section 5 
# series 

import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_list) # this is a series object. Series is a pandas object.

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(my_list,index=labels) # this will give you the same thing as above using the labels as the index

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels) # this is the same as above but with numpy array

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d) # this is the same as above but with a dictionary

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser1['USA']

1

In [11]:
ser2 = pd.Series([1,2,5,4],index=['USA','China','Italy','Japan'])

In [12]:
ser1 + ser2 # this will add the values of the series together. If the index is not the same it will return a NaN

China      NaN
Germany    NaN
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [13]:
import numpy as np
import pandas as pd

In [14]:
from numpy.random import randn

In [15]:
np.random.seed(101) # the seed just makes sure that we get the same random numbers every time we run the code

In [16]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

each column is a pandas series. So W is a series and so are x y and z and they all share a common index. A bunch of series that share an index

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
type(df['W']) # proof that this is a series

pandas.core.series.Series

In [19]:
type(df) # proof that this is a dataframe

pandas.core.frame.DataFrame

In [20]:
df.W # can get same result as df['W'] but this is not recommended because it can cause problems if you have a column with the same name as a method. A method is when you do df. then what follows is a method

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
df[['W','Z']] # this will return a dataframe with the columns W and Z. We needed two brackets because we are passing in a list of columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [22]:
# create new column 
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [23]:
# remove column 
df.drop('new',axis=1) # must specify axis=1 because default is axis=0 which is the index. This will not remove the column from the dataframe. It will just return a new dataframe without the column. To remove the column permanently you must set inplace=True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# notice when we do df again the new column is still there. This is because we did not set inplace=True
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
df.drop('new', axis=1, inplace=True)

In [26]:
# now you see that the new column is gone 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# us .drop to drop rows
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Why are the rows 0 and why are the columns 1 in the axis??? It comes back to numpy. Since dfs are just fancy index markers ontop of a numpy array

In [28]:
# to show the above statement we will show that df.shape is a tuple with the first value being the number of rows and the second value being the number of columns
df.shape
# at the 0 index we have 5 rows and at the 1 index we have 4 columns this is why rows are reffered to the 0 axis and columns are reffered to the 1 axis

(5, 4)

In [29]:
# select columns 
df[['Z', 'X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
# Select Rows - two ways to do 0 loc and iloc (index location)
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [32]:
# iloc is just doing the same thing but with the index of the row not the name of the row
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
df.loc['B','Y'] # row b column y

-0.8480769834036315

In [34]:
df.loc[['A','B'],['W','Y']] # rows a and b columns w and y

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## DataFrames Part 2

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# conditional selection using bracket notation 
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [37]:
booldf = df > 0
df[booldf] # this gives a table with NaN for values that are false and gives the actual values where it is true

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df>0] # gives the same thing but in one line

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
# can also just select a row and see where this statment is true
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [40]:
df['W'] # notice that the above booleans line up with the actual column values

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
df[df['W']>0] # we should only get back the rows A and C since they are non negative

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df[df['Z']<0] # this is asking for all rows where the value in column Z is less than 0

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [43]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df[df['W']>0]['X'] # this is asking for all rows where the value in column W is greater than 0 and then asking for the values in column X

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
df[df['W']>0][['Y','X']] # this is asking for all rows where the value in column W is greater than 0 and then asking for the values in column Y and X
# lets break this down below

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [46]:
boolser = df['W']>0 # Finds where the values in column W are greater than 0 and returns a boolean series
result = df[boolser] # Finds the rows where the values in column W are greater than 0 and returns a dataframe
mycols = ['Y','X'] # this is a list of the columns we want to return
result[mycols] # this returns the columns Y and X from the dataframe result

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [47]:
# if we want to take a series of boolean ops must use & because "and" operator will get confused
df[(df['W']>0) & (df['Y']>1)] # must use & instead of and 
# to do the same thing with "or" instead of "and" use the | operator

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
# now we are going to reset the index with reset_indes() method
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [50]:
newind = 'CA NY WY OR CO'.split() # this will split the string into a list. .split is a way to split off a blank space and add the comma for you 
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [51]:
df['States'] = newind # this will add a new column called States and set the values to the list newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [52]:
# if we want States to be the index we say .set_index
df.set_index('States') # this will set the index to the values in the States column

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## DataFrames Part 3

In [53]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # this will zip the two lists together
hier_index = pd.MultiIndex.from_tuples(hier_index) # this will create a multi index from the tuples in hier_index

In [54]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [55]:
inside

[1, 2, 3, 1, 2, 3]

In [56]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [57]:
# multi index dataframe 
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [58]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [59]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [60]:
# to name index
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [61]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [62]:
# now grab 1.862864
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [63]:
df.xs('G1') # this will grab all the rows where the index is G1. xs is cross section and can go inside without specifying the index all the way

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

## Missing Data

In [65]:
import numpy as np
import pandas as pd

In [66]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # np.nan = missing ordinal value

In [67]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [68]:
df.dropna() # this will drop any row that has a NaN value

     A    B  C
0  1.0  5.0  1

In [69]:
df.dropna(axis=1) # this will drop any columns that has a NaN value

   C
0  1
1  2
2  3

In [70]:
df.dropna(thresh=2) # this will drop any rows that have less than 2 non NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [72]:
df.fillna(value='FILL VALUE') # this will fill any NaN values with the string FILL VALUE

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [73]:
df['A'].fillna(value=df['A'].mean()) # this will fill any NaN values in column A with the mean of column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

Groupby allows you to group together rows based off of a column and perform an aggregate function on them

In [75]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [76]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350